app/views/users/show.html.erb


          <% User.all.each do |u| %>
---
SELECT "users".* FROM "users"

                  <% @detailedDebts[u.id].each do |iou| %>
                    <%= User.find(iou.debtor_id).email %> -> <%= User.find(iou.lender_id).email %> <br>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]