app/views/users/show.html.erb

SELECT "ious".* FROM "ious" WHERE "ious"."debtor_id" = ?  [["debtor_id", 6]]
---
        	<br><br>
          <% Iou.where(debtor_id: current_user.id).each do |IOU| %>

SELECT "ious".* FROM "ious" WHERE "ious"."lender_id" = ?  [["lender_id", 6]]
---
        	<br><br>
          <% Iou.where(lender_id: current_user.id).each do |UOM| %>