app/views/ious/new.html.erb

    Select person who paid for this: </br>
    <% User.all.each do |user| %>
---
SELECT "users".* FROM "users"