app/views/completeds/show_debts.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
<% @q.each do |completed| %>
    <%= User.find(completed.lender_id).username %>