app/controllers/completeds_controller.rb

SELECT "ious".* FROM "ious" WHERE "ious"."debtor_id" = ? AND "ious"."lender_id" = ?  [["debtor_id", 3], ["lender_id", 1]]
INSERT INTO "completeds" ("lender_id", "debtor_id", "created_at", "updated_at", "description", "amt") VALUES (?, ?, ?, ?, ?, ?)  [["lender_id", 2], ["debtor_id", 3], ["created_at", "2017-11-28 06:21:07.596295"], ["updated_at", "2017-11-28 06:21:07.596295"], ["description", "iou2"], ["amt", 10.0]]
DELETE FROM "ious" WHERE "ious"."id" = ?  [["id", 2]]
---
    def move
        q1 = Iou.where(debtor_id: params[:debtor], lender_id: current_user.id)
        q2 = Iou.where(debtor_id: current_user.id, lender_id: params[:debtor])
        q = q1 | q2
        q.each do |iou|
            Completed.create(description: iou.description, amt: iou.amt, lender_id: iou.lender_id, debtor_id: iou.debtor_id)
            iou.destroy