app/controllers/ious_controller.rb

INSERT INTO "ious" ("lender_id", "debtor_id", "created_at", "updated_at", "description", "amt") VALUES (?, ?, ?, ?, ?, ?)  [["lender_id", 2], ["debtor_id", 1], ["created_at", "2017-11-27 20:42:07.366058"], ["updated_at", "2017-11-27 20:42:07.366058"], ["description", "boba"], ["amt", 12.0]]
---
	def create
		@iou = Iou.create(description: params[:description], amt: params[:amt], lender_id: params[:lender], debtor_id: params[:debtor])