app/controllers/users_controller.rb

SELECT "ious".* FROM "ious" WHERE "ious"."debtor_id" = ?  [["debtor_id", 6]]
SELECT SUM("ious"."amt") FROM "ious" WHERE "ious"."debtor_id" = ?  [["debtor_id", 4]]
SELECT "ious".* FROM "ious" WHERE "ious"."lender_id" = ?  [["lender_id", 6]]
SELECT SUM("ious"."amt") FROM "ious" WHERE "ious"."lender_id" = ?  [["lender_id", 4]]
---
	def show
		@totalDebts = Iou.where(debtor_id: current_user.id).sum(:amt)
		@totalLoans = Iou.where(lender_id: current_user.id).sum(:amt)

SELECT  "users".* FROM "users" WHERE "users"."email" = ? ORDER BY "users"."id" ASC LIMIT ?  [["email", "personc@test.com"], ["LIMIT", 1]]
---
	def send_reminder_mail
		@user = User.find_for_authentication(:email => params[:debtor])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def send_paid_mail
		@user = User.find(params[:debtor])